Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.0.38/samv71/edc/ATSAMV71N21.PIC
      <edc:AdjustPoint edc:_addr="0x40024048" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x4002404C" edc:access="------------------------nnnnnnnn" edc:cname="US_IF" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART0">
            <edc:SFRFieldDef edc:cname="IRDA_FILTER" edc:desc="IrDA Filter" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40024050" edc:access="nnnn--nn----nnnn---n--nn----nnnn" edc:cname="US_MAN" edc:impl="0xF30F130F" edc:nzwidth="0x20" ltx:memberofperipheral="USART0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART0">
            <edc:SFRFieldDef edc:cname="TX_PL" edc:desc="Transmitter Preamble Length" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="TX_PP" edc:desc="Transmitter Preamble Pattern" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="ALL_ONE" edc:desc="The preamble is composed of '1's" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ALL_ZERO" edc:desc="The preamble is composed of '0's" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="ZERO_ONE" edc:desc="The preamble is composed of '01's" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="ONE_ZERO" edc:desc="The preamble is composed of '10's" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TX_MPOL" edc:desc="Transmitter Manchester Polarity" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RX_PL" edc:desc="Receiver Preamble Length" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="RX_PP" edc:desc="Receiver Preamble Pattern detected" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="ALL_ONE" edc:desc="The preamble is composed of '1's" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ALL_ZERO" edc:desc="The preamble is composed of '0's" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="ZERO_ONE" edc:desc="The preamble is composed of '01's" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="ONE_ZERO" edc:desc="The preamble is composed of '10's" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RX_MPOL" edc:desc="Receiver Manchester Polarity" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ONE" edc:desc="Must Be Set to 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DRIFT" edc:desc="Drift Compensation" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXIDLEV" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40024054" edc:access="--------------nnnnnnnnnnnnnnnnnn" edc:cname="US_LINMR" edc:impl="0x3FFFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART0">
            <edc:SFRFieldDef edc:cname="NACT" edc:desc="LIN Node Action" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="PUBLISH" edc:desc="The USART transmits the response." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="SUBSCRIBE" edc:desc="The USART receives the response." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="IGNORE" edc:desc="The USART does not transmit and does not receive the response." edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PARDIS" edc:desc="Parity Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHKDIS" edc:desc="Checksum Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHKTYP" edc:desc="Checksum Type" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DLM" edc:desc="Data Length Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSDIS" edc:desc="Frame Slot Mode Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WKUPTYP" edc:desc="Wakeup Signal Type" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DLC" edc:desc="Data Length Control" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PDCM" edc:desc="DMAC Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SYNCDIS" edc:desc="Synchronization Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40024058" edc:access="------------------------nnnnnnnn" edc:cname="US_LINIR" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART0">
            <edc:SFRFieldDef edc:cname="IDCHR" edc:desc="Identifier Character" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4002405C" edc:access="-------------rrrrrrrrrrrrrrrrrrr" edc:cname="US_LINBRR" edc:impl="0x7FFFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART0">
            <edc:SFRFieldDef edc:cname="LINCD" edc:desc="Clock Divider after Synchronization" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="LINFP" edc:desc="Fractional Part after Synchronization" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40024060" edc:access="--------nnnnnnnn----------nnnnnn" edc:cname="US_LONMR" edc:impl="0xFF003F" edc:nzwidth="0x20" ltx:memberofperipheral="USART0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART0">
            <edc:SFRFieldDef edc:cname="COMMT" edc:desc="LON comm_type Parameter Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COLDET" edc:desc="LON Collision Detection Feature" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCOL" edc:desc="Terminate Frame upon Collision Notification" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CDTAIL" edc:desc="LON Collision Detection on Frame Tail" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMAM" edc:desc="LON DMA Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LCDS" edc:desc="LON Collision Detection Source" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xA"/>
            <edc:SFRFieldDef edc:cname="EOFS" edc:desc="End of Frame Condition Size" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40024064" edc:access="------------------nnnnnnnnnnnnnn" edc:cname="US_LONPR" edc:impl="0x3FFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART0">
            <edc:SFRFieldDef edc:cname="LONPL" edc:desc="LON Preamble Length" edc:nzwidth="0xE"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40024068" edc:access="------------------------nnnnnnnn" edc:cname="US_LONDL" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART0">
            <edc:SFRFieldDef edc:cname="LONDL" edc:desc="LON Data Length" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
