Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.0.38/samv71/edc/ATSAMV71N21.PIC
      <edc:SFRDef edc:_addr="0x40038108" edc:access="-----------------nnnn-nn-nnnnnn-" edc:cname="USBHS_DEVEPTCFG2" edc:impl="0x7B7E" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ALLOC" edc:desc="Endpoint Memory Allocate" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EPBK" edc:desc="Endpoint Banks" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="_1_BANK" edc:desc="Single-bank endpoint" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_2_BANK" edc:desc="Double-bank endpoint" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_3_BANK" edc:desc="Triple-bank endpoint" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="EPSIZE" edc:desc="Endpoint Size" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="_8_BYTE" edc:desc="8 bytes" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_16_BYTE" edc:desc="16 bytes" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_32_BYTE" edc:desc="32 bytes" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_64_BYTE" edc:desc="64 bytes" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="_128_BYTE" edc:desc="128 bytes" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="_256_BYTE" edc:desc="256 bytes" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="_512_BYTE" edc:desc="512 bytes" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="_1024_BYTE" edc:desc="1024 bytes" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDIR" edc:desc="Endpoint Direction" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="OUT" edc:desc="The endpoint direction is OUT." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="IN" edc:desc="The endpoint direction is IN (nor for control endpoints)." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="AUTOSW" edc:desc="Automatic Switch" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPTYPE" edc:desc="Endpoint Type" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="CTRL" edc:desc="Control" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ISO" edc:desc="Isochronous" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="BLK" edc:desc="Bulk" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="INTRPT" edc:desc="Interrupt" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="NBTRANS" edc:desc="Number of transactions per microframe for isochronous endpoint" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="_0_TRANS" edc:desc="Reserved to endpoint that does not have the high-bandwidth isochronous capability." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_1_TRANS" edc:desc="Default value: one transaction per microframe." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_2_TRANS" edc:desc="Two transactions per microframe. This endpoint should be configured as double-bank." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_3_TRANS" edc:desc="Three transactions per microframe. This endpoint should be configured as triple-bank." edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003810C" edc:access="-----------------nnnn-nn-nnnnnn-" edc:cname="USBHS_DEVEPTCFG3" edc:impl="0x7B7E" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ALLOC" edc:desc="Endpoint Memory Allocate" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EPBK" edc:desc="Endpoint Banks" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="_1_BANK" edc:desc="Single-bank endpoint" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_2_BANK" edc:desc="Double-bank endpoint" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_3_BANK" edc:desc="Triple-bank endpoint" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="EPSIZE" edc:desc="Endpoint Size" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="_8_BYTE" edc:desc="8 bytes" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_16_BYTE" edc:desc="16 bytes" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_32_BYTE" edc:desc="32 bytes" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_64_BYTE" edc:desc="64 bytes" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="_128_BYTE" edc:desc="128 bytes" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="_256_BYTE" edc:desc="256 bytes" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="_512_BYTE" edc:desc="512 bytes" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="_1024_BYTE" edc:desc="1024 bytes" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDIR" edc:desc="Endpoint Direction" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="OUT" edc:desc="The endpoint direction is OUT." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="IN" edc:desc="The endpoint direction is IN (nor for control endpoints)." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="AUTOSW" edc:desc="Automatic Switch" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPTYPE" edc:desc="Endpoint Type" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="CTRL" edc:desc="Control" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ISO" edc:desc="Isochronous" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="BLK" edc:desc="Bulk" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="INTRPT" edc:desc="Interrupt" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="NBTRANS" edc:desc="Number of transactions per microframe for isochronous endpoint" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="_0_TRANS" edc:desc="Reserved to endpoint that does not have the high-bandwidth isochronous capability." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_1_TRANS" edc:desc="Default value: one transaction per microframe." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_2_TRANS" edc:desc="Two transactions per microframe. This endpoint should be configured as double-bank." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_3_TRANS" edc:desc="Three transactions per microframe. This endpoint should be configured as triple-bank." edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038110" edc:access="-----------------nnnn-nn-nnnnnn-" edc:cname="USBHS_DEVEPTCFG4" edc:impl="0x7B7E" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ALLOC" edc:desc="Endpoint Memory Allocate" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EPBK" edc:desc="Endpoint Banks" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="_1_BANK" edc:desc="Single-bank endpoint" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_2_BANK" edc:desc="Double-bank endpoint" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_3_BANK" edc:desc="Triple-bank endpoint" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="EPSIZE" edc:desc="Endpoint Size" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="_8_BYTE" edc:desc="8 bytes" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_16_BYTE" edc:desc="16 bytes" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_32_BYTE" edc:desc="32 bytes" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_64_BYTE" edc:desc="64 bytes" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="_128_BYTE" edc:desc="128 bytes" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="_256_BYTE" edc:desc="256 bytes" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="_512_BYTE" edc:desc="512 bytes" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="_1024_BYTE" edc:desc="1024 bytes" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDIR" edc:desc="Endpoint Direction" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="OUT" edc:desc="The endpoint direction is OUT." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="IN" edc:desc="The endpoint direction is IN (nor for control endpoints)." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="AUTOSW" edc:desc="Automatic Switch" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPTYPE" edc:desc="Endpoint Type" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="CTRL" edc:desc="Control" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ISO" edc:desc="Isochronous" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="BLK" edc:desc="Bulk" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="INTRPT" edc:desc="Interrupt" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="NBTRANS" edc:desc="Number of transactions per microframe for isochronous endpoint" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="_0_TRANS" edc:desc="Reserved to endpoint that does not have the high-bandwidth isochronous capability." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_1_TRANS" edc:desc="Default value: one transaction per microframe." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_2_TRANS" edc:desc="Two transactions per microframe. This endpoint should be configured as double-bank." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_3_TRANS" edc:desc="Three transactions per microframe. This endpoint should be configured as triple-bank." edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038114" edc:access="-----------------nnnn-nn-nnnnnn-" edc:cname="USBHS_DEVEPTCFG5" edc:impl="0x7B7E" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ALLOC" edc:desc="Endpoint Memory Allocate" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EPBK" edc:desc="Endpoint Banks" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="_1_BANK" edc:desc="Single-bank endpoint" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_2_BANK" edc:desc="Double-bank endpoint" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_3_BANK" edc:desc="Triple-bank endpoint" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="EPSIZE" edc:desc="Endpoint Size" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="_8_BYTE" edc:desc="8 bytes" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_16_BYTE" edc:desc="16 bytes" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_32_BYTE" edc:desc="32 bytes" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_64_BYTE" edc:desc="64 bytes" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="_128_BYTE" edc:desc="128 bytes" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="_256_BYTE" edc:desc="256 bytes" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="_512_BYTE" edc:desc="512 bytes" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="_1024_BYTE" edc:desc="1024 bytes" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDIR" edc:desc="Endpoint Direction" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="OUT" edc:desc="The endpoint direction is OUT." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="IN" edc:desc="The endpoint direction is IN (nor for control endpoints)." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="AUTOSW" edc:desc="Automatic Switch" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPTYPE" edc:desc="Endpoint Type" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="CTRL" edc:desc="Control" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ISO" edc:desc="Isochronous" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="BLK" edc:desc="Bulk" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="INTRPT" edc:desc="Interrupt" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="NBTRANS" edc:desc="Number of transactions per microframe for isochronous endpoint" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="_0_TRANS" edc:desc="Reserved to endpoint that does not have the high-bandwidth isochronous capability." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_1_TRANS" edc:desc="Default value: one transaction per microframe." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_2_TRANS" edc:desc="Two transactions per microframe. This endpoint should be configured as double-bank." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_3_TRANS" edc:desc="Three transactions per microframe. This endpoint should be configured as triple-bank." edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
