Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.0.38/samv71/edc/ATSAMV71N21.PIC
      <edc:SFRDef edc:_addr="0x4003C01C" edc:access="--------------------rrrrrrrrrrrr" edc:cname="AFEC0_CHSR" edc:impl="0xFFF" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC0">
            <edc:SFRFieldDef edc:cname="CH0" edc:desc="Channel 0 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH1" edc:desc="Channel 1 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH2" edc:desc="Channel 2 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH3" edc:desc="Channel 3 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH4" edc:desc="Channel 4 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH5" edc:desc="Channel 5 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH6" edc:desc="Channel 6 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH7" edc:desc="Channel 7 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH8" edc:desc="Channel 8 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH9" edc:desc="Channel 9 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH10" edc:desc="Channel 10 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH11" edc:desc="Channel 11 Status" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003C020" edc:access="----rrrr--------rrrrrrrrrrrrrrrr" edc:cname="AFEC0_LCDR" edc:impl="0xF00FFFF" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC0">
            <edc:SFRFieldDef edc:cname="LDATA" edc:desc="Last Data Converted" edc:nzwidth="0x10"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="CHNB" edc:desc="Channel Number" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003C024" edc:access="-w---www------------wwwwwwwwwwww" edc:cname="AFEC0_IER" edc:impl="0x47000FFF" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC0">
            <edc:SFRFieldDef edc:cname="EOC0" edc:desc="End of Conversion Interrupt Enable 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC1" edc:desc="End of Conversion Interrupt Enable 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC2" edc:desc="End of Conversion Interrupt Enable 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC3" edc:desc="End of Conversion Interrupt Enable 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC4" edc:desc="End of Conversion Interrupt Enable 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC5" edc:desc="End of Conversion Interrupt Enable 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC6" edc:desc="End of Conversion Interrupt Enable 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC7" edc:desc="End of Conversion Interrupt Enable 7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC8" edc:desc="End of Conversion Interrupt Enable 8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC9" edc:desc="End of Conversion Interrupt Enable 9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC10" edc:desc="End of Conversion Interrupt Enable 10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC11" edc:desc="End of Conversion Interrupt Enable 11" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="DRDY" edc:desc="Data Ready Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GOVRE" edc:desc="General Overrun Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPE" edc:desc="Comparison Event Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TEMPCHG" edc:desc="Temperature Change Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003C028" edc:access="-w---www------------wwwwwwwwwwww" edc:cname="AFEC0_IDR" edc:impl="0x47000FFF" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC0">
            <edc:SFRFieldDef edc:cname="EOC0" edc:desc="End of Conversion Interrupt Disable 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC1" edc:desc="End of Conversion Interrupt Disable 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC2" edc:desc="End of Conversion Interrupt Disable 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC3" edc:desc="End of Conversion Interrupt Disable 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC4" edc:desc="End of Conversion Interrupt Disable 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC5" edc:desc="End of Conversion Interrupt Disable 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC6" edc:desc="End of Conversion Interrupt Disable 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC7" edc:desc="End of Conversion Interrupt Disable 7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC8" edc:desc="End of Conversion Interrupt Disable 8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC9" edc:desc="End of Conversion Interrupt Disable 9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC10" edc:desc="End of Conversion Interrupt Disable 10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC11" edc:desc="End of Conversion Interrupt Disable 11" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="DRDY" edc:desc="Data Ready Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GOVRE" edc:desc="General Overrun Error Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPE" edc:desc="Comparison Event Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TEMPCHG" edc:desc="Temperature Change Interrupt Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003C02C" edc:access="-r---rrr------------rrrrrrrrrrrr" edc:cname="AFEC0_IMR" edc:impl="0x47000FFF" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC0">
            <edc:SFRFieldDef edc:cname="EOC0" edc:desc="End of Conversion Interrupt Mask 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC1" edc:desc="End of Conversion Interrupt Mask 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC2" edc:desc="End of Conversion Interrupt Mask 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC3" edc:desc="End of Conversion Interrupt Mask 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC4" edc:desc="End of Conversion Interrupt Mask 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC5" edc:desc="End of Conversion Interrupt Mask 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC6" edc:desc="End of Conversion Interrupt Mask 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC7" edc:desc="End of Conversion Interrupt Mask 7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC8" edc:desc="End of Conversion Interrupt Mask 8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC9" edc:desc="End of Conversion Interrupt Mask 9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC10" edc:desc="End of Conversion Interrupt Mask 10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC11" edc:desc="End of Conversion Interrupt Mask 11" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="DRDY" edc:desc="Data Ready Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GOVRE" edc:desc="General Overrun Error Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPE" edc:desc="Comparison Event Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TEMPCHG" edc:desc="Temperature Change Interrupt Mask" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003C030" edc:access="-r---rrr------------rrrrrrrrrrrr" edc:cname="AFEC0_ISR" edc:impl="0x47000FFF" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC0">
            <edc:SFRFieldDef edc:cname="EOC0" edc:desc="End of Conversion 0 (cleared by reading AFEC_CDRx)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC1" edc:desc="End of Conversion 1 (cleared by reading AFEC_CDRx)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC2" edc:desc="End of Conversion 2 (cleared by reading AFEC_CDRx)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC3" edc:desc="End of Conversion 3 (cleared by reading AFEC_CDRx)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC4" edc:desc="End of Conversion 4 (cleared by reading AFEC_CDRx)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC5" edc:desc="End of Conversion 5 (cleared by reading AFEC_CDRx)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC6" edc:desc="End of Conversion 6 (cleared by reading AFEC_CDRx)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC7" edc:desc="End of Conversion 7 (cleared by reading AFEC_CDRx)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC8" edc:desc="End of Conversion 8 (cleared by reading AFEC_CDRx)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC9" edc:desc="End of Conversion 9 (cleared by reading AFEC_CDRx)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC10" edc:desc="End of Conversion 10 (cleared by reading AFEC_CDRx)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC11" edc:desc="End of Conversion 11 (cleared by reading AFEC_CDRx)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="DRDY" edc:desc="Data Ready (cleared by reading AFEC_LCDR)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GOVRE" edc:desc="General Overrun Error (cleared by reading AFEC_ISR)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPE" edc:desc="Comparison Error (cleared by reading AFEC_ISR)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TEMPCHG" edc:desc="Temperature Change (cleared on read)" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4003C034" edc:offset="0x18"/>
      <edc:SFRDef edc:_addr="0x4003C04C" edc:access="--------------------rrrrrrrrrrrr" edc:cname="AFEC0_OVER" edc:impl="0xFFF" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC0">
            <edc:SFRFieldDef edc:cname="OVRE0" edc:desc="Overrun Error 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE1" edc:desc="Overrun Error 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE2" edc:desc="Overrun Error 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE3" edc:desc="Overrun Error 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE4" edc:desc="Overrun Error 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE5" edc:desc="Overrun Error 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE6" edc:desc="Overrun Error 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE7" edc:desc="Overrun Error 7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE8" edc:desc="Overrun Error 8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE9" edc:desc="Overrun Error 9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE10" edc:desc="Overrun Error 10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE11" edc:desc="Overrun Error 11" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003C050" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="AFEC0_CWR" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC0">
            <edc:SFRFieldDef edc:cname="LOWTHRES" edc:desc="Low Threshold" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="HIGHTHRES" edc:desc="High Threshold" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003C054" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="AFEC0_CGR" edc:impl="0xFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC0">
            <edc:SFRFieldDef edc:cname="GAIN0" edc:desc="Gain for Channel 0" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="GAIN1" edc:desc="Gain for Channel 1" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="GAIN2" edc:desc="Gain for Channel 2" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="GAIN3" edc:desc="Gain for Channel 3" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="GAIN4" edc:desc="Gain for Channel 4" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="GAIN5" edc:desc="Gain for Channel 5" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="GAIN6" edc:desc="Gain for Channel 6" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="GAIN7" edc:desc="Gain for Channel 7" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="GAIN8" edc:desc="Gain for Channel 8" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="GAIN9" edc:desc="Gain for Channel 9" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="GAIN10" edc:desc="Gain for Channel 10" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="GAIN11" edc:desc="Gain for Channel 11" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4003C058" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x4003C060" edc:access="--------------------nnnnnnnnnnnn" edc:cname="AFEC0_DIFFR" edc:impl="0xFFF" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC0">
            <edc:SFRFieldDef edc:cname="DIFF0" edc:desc="Differential inputs for channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF1" edc:desc="Differential inputs for channel 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF2" edc:desc="Differential inputs for channel 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF3" edc:desc="Differential inputs for channel 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF4" edc:desc="Differential inputs for channel 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF5" edc:desc="Differential inputs for channel 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF6" edc:desc="Differential inputs for channel 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF7" edc:desc="Differential inputs for channel 7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF8" edc:desc="Differential inputs for channel 8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF9" edc:desc="Differential inputs for channel 9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF10" edc:desc="Differential inputs for channel 10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF11" edc:desc="Differential inputs for channel 11" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003C064" edc:access="----------------------------nnnn" edc:cname="AFEC0_CSELR" edc:impl="0xF" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC0">
            <edc:SFRFieldDef edc:cname="CSEL" edc:desc="Channel Selection" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
