Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.0.38/samv71/edc/ATSAMV71N21.PIC
      <edc:SFRDef edc:_addr="0x40050764" edc:access="-----------------------nnnnnnnnn" edc:cname="GMAC_ST2CW112" edc:impl="0x1FF" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="OFFSVAL" edc:desc="Offset Value in Bytes" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="OFFSSTRT" edc:desc="Ethernet Frame Offset Start" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="FRAMESTART" edc:desc="Offset from the start of the frame" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ETHERTYPE" edc:desc="Offset from the byte after the EtherType field" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="IP" edc:desc="Offset from the byte after the IP header field" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TCP_UDP" edc:desc="Offset from the byte after the TCP/UDP header field" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050768" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GMAC_ST2CW013" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="MASKVAL" edc:desc="Mask Value" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="COMPVAL" edc:desc="Compare Value" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005076C" edc:access="-----------------------nnnnnnnnn" edc:cname="GMAC_ST2CW113" edc:impl="0x1FF" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="OFFSVAL" edc:desc="Offset Value in Bytes" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="OFFSSTRT" edc:desc="Ethernet Frame Offset Start" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="FRAMESTART" edc:desc="Offset from the start of the frame" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ETHERTYPE" edc:desc="Offset from the byte after the EtherType field" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="IP" edc:desc="Offset from the byte after the IP header field" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TCP_UDP" edc:desc="Offset from the byte after the TCP/UDP header field" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050770" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GMAC_ST2CW014" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="MASKVAL" edc:desc="Mask Value" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="COMPVAL" edc:desc="Compare Value" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050774" edc:access="-----------------------nnnnnnnnn" edc:cname="GMAC_ST2CW114" edc:impl="0x1FF" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="OFFSVAL" edc:desc="Offset Value in Bytes" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="OFFSSTRT" edc:desc="Ethernet Frame Offset Start" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="FRAMESTART" edc:desc="Offset from the start of the frame" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ETHERTYPE" edc:desc="Offset from the byte after the EtherType field" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="IP" edc:desc="Offset from the byte after the IP header field" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TCP_UDP" edc:desc="Offset from the byte after the TCP/UDP header field" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050778" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GMAC_ST2CW015" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="MASKVAL" edc:desc="Mask Value" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="COMPVAL" edc:desc="Compare Value" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005077C" edc:access="-----------------------nnnnnnnnn" edc:cname="GMAC_ST2CW115" edc:impl="0x1FF" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="OFFSVAL" edc:desc="Offset Value in Bytes" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="OFFSSTRT" edc:desc="Ethernet Frame Offset Start" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="FRAMESTART" edc:desc="Offset from the start of the frame" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ETHERTYPE" edc:desc="Offset from the byte after the EtherType field" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="IP" edc:desc="Offset from the byte after the IP header field" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TCP_UDP" edc:desc="Offset from the byte after the TCP/UDP header field" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050780" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GMAC_ST2CW016" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="MASKVAL" edc:desc="Mask Value" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="COMPVAL" edc:desc="Compare Value" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050784" edc:access="-----------------------nnnnnnnnn" edc:cname="GMAC_ST2CW116" edc:impl="0x1FF" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="OFFSVAL" edc:desc="Offset Value in Bytes" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="OFFSSTRT" edc:desc="Ethernet Frame Offset Start" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="FRAMESTART" edc:desc="Offset from the start of the frame" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ETHERTYPE" edc:desc="Offset from the byte after the EtherType field" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="IP" edc:desc="Offset from the byte after the IP header field" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TCP_UDP" edc:desc="Offset from the byte after the TCP/UDP header field" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050788" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GMAC_ST2CW017" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="MASKVAL" edc:desc="Mask Value" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="COMPVAL" edc:desc="Compare Value" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005078C" edc:access="-----------------------nnnnnnnnn" edc:cname="GMAC_ST2CW117" edc:impl="0x1FF" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="OFFSVAL" edc:desc="Offset Value in Bytes" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="OFFSSTRT" edc:desc="Ethernet Frame Offset Start" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="FRAMESTART" edc:desc="Offset from the start of the frame" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ETHERTYPE" edc:desc="Offset from the byte after the EtherType field" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="IP" edc:desc="Offset from the byte after the IP header field" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TCP_UDP" edc:desc="Offset from the byte after the TCP/UDP header field" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050790" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GMAC_ST2CW018" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="MASKVAL" edc:desc="Mask Value" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="COMPVAL" edc:desc="Compare Value" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050794" edc:access="-----------------------nnnnnnnnn" edc:cname="GMAC_ST2CW118" edc:impl="0x1FF" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="OFFSVAL" edc:desc="Offset Value in Bytes" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="OFFSSTRT" edc:desc="Ethernet Frame Offset Start" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="FRAMESTART" edc:desc="Offset from the start of the frame" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ETHERTYPE" edc:desc="Offset from the byte after the EtherType field" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="IP" edc:desc="Offset from the byte after the IP header field" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TCP_UDP" edc:desc="Offset from the byte after the TCP/UDP header field" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050798" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GMAC_ST2CW019" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="MASKVAL" edc:desc="Mask Value" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="COMPVAL" edc:desc="Compare Value" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
